const ErrorMessage = {
  LOGIN_FAILED:
    'รหัสนักศึกษา หรือ รหัสผ่านไม่ถูกต้อง \nหรือไม่สามารถเชื่อมต่อกับ API Gateway ได้ \n\n โปรดตรวจสอบข้อมูลแล้วลองใหม่อีกครั้ง.',
  APP_VERSION_MISMATCHED: `คุณกำลังใช้งานบนแอพลิเคชั่นเวอร์ชั่นเก่าอยู่ ซึ่งอาจทำให้ไม่สามารถใช้งาน API ได้อย่างสมบูรณ์. \nกรุณาอัพเดทแอพลิเคชั่นให้เป็นเวอร์ชั่นล่าสุดครับ .`,
  APP_ROOT_DETECTED: `ระบบไม่อนุญาตให้ใช้งานบนอุปกรณ์ที่มีการดัดแปลง (Jailbreak / Root) เพื่อความปลอดภัยของท่าน กรุณาใช้งานบนอุปกรณ์ที่ไม่ผ่านการดัดแปลง. หากท่านไม่ได้มีการดัดแปลงอุปกรณ์ โปรดตรวจสอบว่าท่านได้ใช้งานบน Android Version 7.0 หรือสูงกว่า`,
};

export {ErrorMessage};
