export const ErrorMessage = {
  TITLE_LOGIN_ERROR: 'ข้อผิดพลาด',
  TITLE_LOGIN_FIELD_NULL: 'โปรดกรอกข้อมูลการเข้าสู่ระบบให้ครบถ้วน',
  TITLE_LOGIN_FAILED: 'เข้าสู่ระบบล้มเหลว',
  TITLE_REGISTER_FAILED: 'ลงทะเบียนล้มเหลว',
  TITLE_API_ERROR: 'ไม่สามารถเชื่อมต่อบริการได้',
  LOGIN_FAILED:
    'รหัสนักศึกษา หรือ รหัสผ่านไม่ถูกต้อง \nโปรดตรวจสอบข้อมูลแล้วลองใหม่อีกครั้ง',
  APP_VERSION_MISMATCHED: `คุณกำลังใช้งานบนแอพลิเคชั่นเวอร์ชั่นเก่าอยู่ ซึ่งอาจทำให้ไม่สามารถใช้งาน API ได้อย่างสมบูรณ์. \nกรุณาอัพเดทแอพลิเคชั่นให้เป็นเวอร์ชั่นล่าสุดครับ .`,
  APP_ROOT_DETECTED: `ระบบไม่อนุญาตให้ใช้งานบนอุปกรณ์ที่มีการดัดแปลง (Jailbreak / Root) \nเพื่อความปลอดภัยของท่าน กรุณาใช้งานบนอุปกรณ์ที่ไม่ผ่านการดัดแปลง \nหากท่านไม่ได้มีการดัดแปลงอุปกรณ์ \nโปรดตรวจสอบว่าท่านได้ใช้งานบน Android Version 7.0 หรือสูงกว่า`,
  APP_HOOK_DETECTED:
    'ระบบไม่อนุญาตให้ใช้งานบนอุปกรณ์ที่มีการลงซอฟแวร์ Thrid Party (Magisk / Root) \nเพื่อความปลอดภัยของท่าน กรุณาใช้งานบนอุปกรณ์ที่ไม่ผ่านการดัดแปลง \nหากท่านไม่ได้มีการดัดแปลงอุปกรณ์ \nโปรดตรวจสอบว่าท่านได้ใช้งานบน Android Version 7.0 หรือสูงกว่า',
  APP_RESTRICT_MAJOR: `สาขาของคุณ  ไม่ได้รับสิทธิ์ให้ใช้งานแอพลิเคชั่นนี้.`,
  APP_MAINTENANCE: 'กำลังปิดปรับปรุง Server',
  APP_RESTRICT_USER: 'ผู้ใช้นี้ ไม่ได้รับอนุญาตให้ใช้งานแอพลิเคชั่นนี้',
  APP_LOGIN_BANNED: 'บัญชีนี้ถูกระงับใช้งาน',
  APP_RESTRICT_STUDENTID:
    'รหัสนักศึกษานี้ ไม่ได้รับอนุญาตให้ใช้งานแอพลิเคชั่นนี้',
  APP_SERVER_ERROR:
    'ไม่สามารถเชื่อมต่อบริการของระบบได้ \nโปรดตรวจสอบการเข้าถึงอินเตอร์เน็ต แล้วลองใหม่อีกครั้ง.',
  APP_REGISTER_BAD_REQ:
    'ไม่สามารถดำเนินการลงทะเบียนบัญชีนี้ได้ เนื่องจากข้อมูลที่ท่านระบุไม่ถูกต้อง โปรดตรวจสอบข้อมูลอีกครั้ง.',
  APP_CONNECTION_FAILED:
    'ไม่มีการเชื่อมต่ออินเตอร์เน็ต \nโปรดตรวจสอบการเข้าถึงอินเตอร์เน็ต แล้วลองใหม่อีกครั้ง.',
};
