export const getPolicyText = () => {
  return (
    '1.แอปพลิเคชันนี้เป็นโปรเจคในการอำนวยความสะดวกให้แก่นักศึกษา' +
    '\n' +
    '\n' +
    '2. ข้อมูลที่แสดงผลในแอปพลิเคชัน เป็นข้อมูลที่ได้จากการประมวลผล ณ  เวลาปัจจุบัน หากพบว่าข้อมูลไม่ถูกต้อง กรุณาติดต่อผู้ดูแลระบบแอปพลิเคชัน' +
    '\n' +
    '\n' +
    '3. ด้วยข้อจำกัดในการใช้งานและยังเป็นระบบทดสอบ ขอสงวนสิทธิ์ให้ใช้งานเฉพาะนักศึกษาสาขาวิชาเทคโนโลยีสารสนเทศ เท่านั้น' +
    '\n' +
    '\n' +
    '4. ห้ามนักศึกษา ตั้งรหัสผ่านเป็นวันเดือนปีเกิด เด็ดขาด เนื่องจากเสี่ยงต่อการถูก Hack / ขโมยข้อมูล และหากมีการล็อกอินผิดเกิน 3 ครั้ง บัญชีของท่านจะถูกระงับใช้งานทันที. และจะต้องติดต่อผู้ดูแลเพื่อปลดล็อคเท่านั้น' +
    '\n' +
    '\n' +
    '5. เพื่อความปลอดภัยของข้อมูลของท่านอย่างสูงสุด ข้อมูลรหัสผ่านที่จัดเก็บในฐานข้อมูล จะถูกเข้ารหัสด้วยวิธีที่ย้อนกลับไม่ได้ หากท่านลืมรหัสผ่านจะต้องรีเซ็ทใหม่ด้วยตัวเองเท่านั้น' +
    '\n' +
    '\n' +
    '6.หากพบข้อผิดพลาดในแอปพลิเคชัน กรุณาติดต่อผู้พัฒนาระบบที่ อีเมล: work@pleum.in.th'
  );
};

export const ALERT_MESSAGE = {
  INFOMATION_CONFIRM_TITLE: 'ยืนยันข้อมูล',
  INFOMATION_CONFIRM_DETAIL:
    'โปรดตรวจสอบข้อมูลของท่านให้แน่ใจแล้วว่าถูกต้อง หากท่านกรอกข้อมูลไม่ถูกต้องหรือรหัสนักศึกษาผิด บัญชีของท่านจะถูกระงับใช้งานทันที',
};
