export const getPolicyText = () => {
  return (
    '1.แอพลิเคชั่นนี้เป็นโปรเจคในการอำนวยความสะดวกให้แก่นักศึกษา' +
    '\n' +
    '\n' +
    '2. ข้อมูลที่แสดงผลในแอพลิเคชั่น เป็นข้อมูลที่ได้จากการประมวลผล ณ  เวลาปัจจุบัน หากพบว่าข้อมูลไม่ถูกต้อง กรุณาติดต่อผู้ดูแลระบบแอพลิเคชั่น' +
    '\n' +
    '\n' +
    '3. ด้วยข้อจำกัดในการใช้งานและยังเป็นระบบทดสอบ ขอสงวนสิทธิ์ให้ใช้งานเฉพาะนักศึกษาสาขาวิชาเทคโนโลยีสารสนเทศ เท่านั้น' +
    '\n' +
    '\n' +
    '4. ห้ามนักศึกษา ตั้งรหัสผ่านเป็นวันเดือนปีเกิด เด็ดขาด เนื่องจากเสี่ยงต่อการถูกแฮก / ขโมยข้อมูล และหากมีการล็อกอินผิดเกิน 3 ครั้ง บัญชีของท่านจะถูกระงับใช้งานทันที. และจะต้องติดต่อผู้ดูแลเพื่อปลดล็อคเท่านั้น' +
    '\n' +
    '\n' +
    '5. เพื่อความปลอดภัยของข้อมูลของท่านอย่างสูงสุด ข้อมูลรหัสผ่านที่จัดเก็บในฐานข้อมูล จะถูกเข้ารหัสด้วยอัลกอริทึม ที่ไม่สามารถถอดรหัสกลับได้ หากลืมรหัสผ่าน ท่านจะต้องรีเซ็ต และ ตั้งรหัสใหม่เท่านั้น ผู้ดูแลระบบไม่สามารถช่วยเหลือในกรณีกู้รหัสผ่านเดิมได้' +
    '\n' +
    '\n' +
    '6.หากพบว่าระบบมีข้อผิดพลาด กรุณาส่งอีเมล พร้อมภาพ Screenshot  ของข้อผิดพลาดนั้นๆมาที่ อีเมล: work@pleum.in.th พร้อมระบุแพลตฟอร์มเช่น Android / iOS'
  );
};
