export const getPolicyText = () => {
  return (
    '1. แอปพลิเคชันนี้เป็นโปรเจคในการอำนวยความสะดวกให้แก่นักศึกษาสาขาวิชาเทคโนโลยีสารสนเทศเท่านั้น' +
    '\n' +
    '\n' +
    '2. ข้อมูลที่แสดงผลในแอปพลิเคชันเป็นข้อมูลที่ได้จากการประมวลผล ในเวลาปัจจุบันหากพบว่าข้อมูลไม่ถูกต้อง กรุณาติดต่อผู้ดูแลระบบแอปพลิเคชัน' +
    '\n' +
    '\n' +
    '3. ด้วยข้อจำกัดในการใช้งานและยังเป็นระบบทดสอบ ขอสงวนสิทธิ์ให้ใช้งานเฉพาะนักศึกษาสาขาวิชาเทคโนโลยีสารสนเทศเท่านั้น' +
    '\n' +
    '\n' +
    '4. ผู้พัฒนาไม่แนะนำให้นักศึกษาตั้งรหัสผ่านเป็นวันเดือนปีเกิดเด็ดขาดเนื่องจากเสี่ยงต่อการถูก Hack / ขโมยข้อมูลส่วนบุคคลและหากมีการล็อกอินผิดเกิน 3 ครั้ง บัญชีของท่านจะถูกระงับใช้งานทันทีและจะต้องติดต่อผู้ดูแลเพื่อปลดล็อคเท่านั้น' +
    '\n' +
    '\n' +
    '5. ข้อมูลของท่านที่จัดเก็บในระบบจะมีการเข้ารหัสและป้องกันการเข้าถึงจากบุคคลภายนอกและจะไม่มีการเปิดเผยข้อมูลของท่านแก่บุคคลที่สาม' +
    '\n' +
    '\n' +
    '6. หากพบข้อผิดพลาดในแอปพลิเคชัน กรุณาติดต่อผู้พัฒนาระบบที่อีเมล: work@pleum.in.th'
  );
};

export const ALERT_MESSAGE = {
  INFOMATION_CONFIRM_TITLE: 'ยืนยันข้อมูล',
  INFOMATION_CONFIRM_DETAIL:
    'โปรดตรวจสอบข้อมูลของท่านให้แน่ใจแล้วว่าถูกต้อง หากท่านกรอกข้อมูลไม่ถูกต้องหรือรหัสนักศึกษาผิด บัญชีของท่านจะถูกระงับใช้งานทันที',
};
